app/controllers/kondatelists_controller.rb

  def createKondate #=>受け取った期間の献立表の雛形を作成する
    if request.post? then
      @kondatelist_data = Kondatelist.all
      if @kondatelist_data.present? then #=>すでにKondateListが存在する場合はコメントを返す
        @msg = "すでに献立表が存在します。削除してから作り直してください！"
      else #=>受け取った期間でKondateListを作成
        (Date.parse(params[:startDate])..Date.parse(params[:endDate])).each do |data|
          Kondatelist.create(kondate_date: data)
        end
        @kondatelist_data = Kondatelist.all
---
SELECT `kondatelists`.* FROM `kondatelists`
INSERT INTO `kondatelists` (`kondate_date`, `created_at`, `updated_at`) VALUES ('2018-12-01', '2018-12-21 03:14:14', '2018-12-21 03:14:14')

  def updateKondate
    if request.post? then
      if params[:allmenu] then #=>Menuの検索結果を返す
        @menu_data = Menu.all
      elsif params[:keyword]  then
        @menu_data = Menu.where('menu_name like ?', "%#{ params[:keyword] }%")
      else #=>Menuテーブルをidで検索しKondateListへ追加する
        obj = Menu.find( params[:id] )
        data = Kondatelist.find( params[:kondate_date] )
        data.update_attributes( kondate_name: obj.menu_name, kondate_url: obj.url, kondate_id: obj.id )
      end
    end
    @kondatelist_data = Kondatelist.all
---
SELECT `menus`.* FROM `menus` WHERE (menu_name like '%ゴルゴン%')
SELECT  `menus`.* FROM `menus` WHERE `menus`.`id` = 2 LIMIT 1
SELECT  `kondatelists`.* FROM `kondatelists` WHERE `kondatelists`.`id` = 1 LIMIT 1
UPDATE `kondatelists` SET `kondate_name` = 'スモークサーモンとアボカドの簡単丼', `kondate_url` = 'https://cookpad.com/recipe/1241303#share_line', `kondate_id` = 2, `updated_at` = '2019-01-08 13:27:37' WHERE `kondatelists`.`id` = 1
SELECT `kondatelists`.* FROM `kondatelists`

  def deleteKondate #=>KondateListとShoppingListを削除
    Kondatelist.delete_all
    ShoppingList.delete_all
---
DELETE FROM `kondatelists`
DELETE FROM `shopping_lists`

  def showKondate

    @shoppingList = ShoppingList.all.select("s_name , sum(s_quantity) as total_quantity, s_unit").group( :s_name )
    @kondatelist = Kondatelist.all

    if @shoppingList.present?
      render = "showKondate" and return
    else #=>KondateList内のMenuに紐づくMaterialListをShoppingListへ登録し、食材名でまとめて分量の合計を出す
      @kondatelist.each do |k|
        data = MaterialList.where( menu_id: k.kondate_id )
        data.each do |d|
          ShoppingList.create(s_name: d.material_name, s_quantity: d.quantity, s_unit: d.unit)
        end
      end
      @shoppingList = ShoppingList.all.select("s_name , sum(s_quantity) as total_quantity, s_unit").group( :s_name )
---
SELECT SUM(`shopping_lists`.`s_quantity`) AS sum_s_quantity, `shopping_lists`.`s_name` AS shopping_lists_s_name FROM `shopping_lists` GROUP BY `shopping_lists`.`s_name`
SELECT s_name , sum(s_quantity) as total_quantity, s_unit FROM `shopping_lists` GROUP BY `shopping_lists`.`s_name`
SELECT `kondatelists`.* FROM `kondatelists`
SELECT `material_lists`.* FROM `material_lists` WHERE `material_lists`.`menu_id` = 1
SELECT `material_lists`.* FROM `material_lists` WHERE `material_lists`.`menu_id` = 10
INSERT INTO `shopping_lists` (`s_name`, `s_quantity`, `s_unit`, `created_at`, `updated_at`) VALUES ('豚ひき肉', 300.0, 'g', '2019-01-31 14:20:13', '2019-01-31 14:20:13')