app/controllers/kondatelists_controller.rb

DELETE FROM `kondatelists`
---
  def deleteKondate
    obj = Kondatelist.all
    obj.delete_all