app/controllers/menus_controller.rb

  def search
    if request.post? then
      @data = Menu.all
---
SELECT `menus`.* FROM `menus`

  def find
    @data = Array.new
    if request.post? then
      @data = Menu.where('menu_name like ?', "%#{ params[:keyword] }%")
---
SELECT `menus`.* FROM `menus` WHERE (menu_name like '%sample%')

  def edit
    if request.post? then
      @edit_data = Menu.find(params[:id])
---
SELECT  `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1

  def update
    if params[:delete] then
      obj = Menu.find(params[:id])
      obj.destroy
      @msg = "メニューリストから削除しました！"
      render "search"
    else
      obj = Menu.find(params[:id])
      obj.update(menu_params)
      obj.update_attributes( date: "", check: false )
---
SELECT  `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1
DELETE FROM `menus` WHERE `menus`.`id` = 4
SELECT  `menus`.* FROM `menus` WHERE `menus`.`id` = 6 LIMIT 1
UPDATE `menus` SET `menu_name` = '半熟卵と鶏肉のこっくり', `url` = 'https://delishkitchen.tv/recipes/162546045924934035', `updated_at` = '2018-12-13 15:13:17' WHERE `menus`.`id` = 6
UPDATE `menus` SET `check` = FALSE WHERE `menus`.`id` = 6

  def add
    @add_data = Menu.new
    if request.post? then
      Menu.create(menu_params)
---
INSERT INTO `menus` (`menu_name`, `url`, `created_at`, `updated_at`) VALUES ('ゴルゴンゾーラポテトグラタ', 'https://delishkitchen.tv/recipes/155445174732849644', '2019-01-08 13:25:15', '2019-01-08 13:25:15')

  def delete
    obj = Menu.find(params[:id])
    obj.destroy
---
SELECT  `menus`.* FROM `menus` WHERE `menus`.`id` = 8 LIMIT 1
DELETE FROM `menus` WHERE `menus`.`id` = 8