app/controllers/menus_controller.rb

  def edit_menu #=> 編集対象のMenu ID を受け取り情報を返す
    @editMenu = Menu.new
    if request.post? then
      @editMenu = Menu.find(params[:id])
---
SELECT  `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1

  def create_menu #=> Menuとそれに紐づくMaterialListを各テーブルへ登録
    @editMenu = Menu.new
    if request.post? then
      if Menu.create(material_params) then
---
INSERT INTO `menus` (`menu_name`, `url`, `created_at`, `updated_at`) VALUES ('肉じゃが', 'sample1.com', '2019-01-28 21:54:40', '2019-01-28 21:54:40')